package ch03_op;

public class OpEx7 {
	 	public static void main(String[] args) {

		System.out.println("6 & 3 = " + (6 & 3));
		/* 둘다 1이여야만 1이됨
		 * 
		 *  6 : 0110
		 *  3 : 0011
		 * ----------- 
		 *  & : 0010 : 2
		 */
		System.out.println("6 | 3 = " + (6 | 3));
		/* 둘다 한개만 1이여도 1이됨
		 * 
		 *  6 : 0110
		 *  3 : 0011
		 * ----------- 
		 *  | : 0111 : 7
		 */
		System.out.println("6 ^ 3 = " + (6 ^ 3));
		/* 같으면 0, 다르면 1
		 * 
		 *  6 : 0110
		 *  3 : 0011
		 * ----------- 
		 *  ^ : 0111 : 5
		 */
		System.out.println("~10 = " + ~10);
		/* 같으면 0, 다르면 1
		 * 
		 *  10 : 	0000 0000 0000 1010
		 *   ~ :	1111 1111 1111 0101
		 *   ~ : 	0000 0000 0000 1010
		 * 2의보수:	0000 0000 0000 1011 = -11
		 * ----------- 
		 *  ~ : -11
		 */
		
	}

}
